#include <iostream>
#include <clocale>
#include <cmath>
using namespace std;

int main() {

    setlocale(LC_ALL, ".UTF8"); // Настройка корректного отображения кириллицы в консоли

    double a_n = 1; // Первый член ряда
    double s = 0; // Переменная для накопления суммы ряд

    // Вычисление суммы 10 членов ряда с использованием рекуррентного множителя
    for(int n = 1; n <= 10; n++) {
        s += a_n; // Суммирование текущего члена ряда

        // Расчёт рекуррентного множителя для перехода к следующему члену ряда
        double mnoj = ((n + 1)  * pow(n, sqrt(n))) / pow(n + 1, sqrt(n + 1)); 
        
        a_n *= mnoj; // Вычисление следующего члена ряда
    }

    cout << "Сумма 10 членов ряда равна: " << s; // Вывод полученной суммы в консоль

    return 0;
}




