#include <iostream>
#include <clocale>
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
    setlocale(LC_ALL, ".UTF8");
    
    double s_n = 0; // Переменная для накопления суммы для заданного n
    double s_e = 0; // Переменная для накопления суммы для заданной точности

    for(double x = 0.1; x <= 1; x += 0.09){
        double a_n = -pow(2 * x, 2) / 2; // Первый член ряда
        s_n = 0; // Обнуление суммы для заданного n при заходе в новый цикл
        s_e = 0; // Обнуление суммы для заданной точности при заходе в новый цикл
        // Арифметический цикл для заданного n
        for(int n = 1; n <= 15; n++) {
            s_n += a_n; // Суммирование текущего члена ряда

            // Расчёт рекуррентного множителя для перехода к следующему члену ряда
            double mnoj = -4 * pow(x, 2) / ((2 * n + 1)*(2 * n + 2));
            a_n *= mnoj; // Вычисление следующего члена ряда
        }

        // Итерационный цикл для заданной точности e (e = 0.0001)
        double a_e = -pow(2 * x, 2) / 2; // Первый член ряда
        s_e = a_e; // Суммирование первого члена ряда
        double i = 1; // Счётчик шагов для формулы множителя

        while(abs(a_e) >= 0.0001){

            // Расчёт рекуррентного множителя для перехода к следующему члену ряда
            double mnoj_e = -4 * pow(x, 2) / ((2 * i + 1)*(2 * i + 2));

            a_e *= mnoj_e; // Вычисление следующего члена ряда
            s_e += a_e; // Суммирование текущего члена ряда
            i++;
        }

        // Нахождение точного значения функции
        double y = 2 * (pow(cos(x), 2) - 1);

        cout << "X = " << x << setw(10) << " " << "SN = " << s_n << setw(10) << " " << "SE = " << s_e << setw(10) << " " << "Y = " << y << endl;
    }

    return 0;
}

